Repository: astrochili/vk320
Catalog: Main/*.lproj/Localizable.strings
Languages: ru

source: Received:
ru: Получено:

# SEARCHFIELD_PLACEHOLDER
source: What are you looking for?
ru: Что будем искать?

# UPDATE_TITLE
source: Update available!
ru: Доступно обновление!

# UPDATE_TEXT
source: New version %@ available for download. You can turn off this notification in settings.
ru: Новая версия %@ доступна для загрузки. Отключить уведомления можно в настройках.

# VERSION_TEXT
source: Current version %@. Actual version %@.
ru: Текущая версия %@. Актуальный релиз %@.

source: Download
ru: Скачать

source: Later
ru: Позже

# Audios on link
source: Getting audios by link
ru: Получение аудиозаписей по ссылке

# SUPPORTED_FORMATS
source: Supported formats: vk.com/xxxxx (user or group) vk.com/audiosxxxxx (audios) vk.com/audiosxxxxx?album_id=xxxxx (album) vk.com/audiosxxxxxfriend=xxxxx (friends) vk.com/wallxxxxx (wall) vk.com/wallxxxxx_xxxxx (post) Just copy a link from the browser and paste it to the search field.
ru: Поддерживаемые форматы: vk.com/xxxxx (пользователь или группа) vk.com/audiosxxxxx (аудиозаписи) vk.com/audiosxxxxx?album_id=xxxxx (альбом) vk.com/audiosxxxxxfriend=xxxxx (друзья) vk.com/wallxxxxx (стена) vk.com/wallxxxxx_xxxxx (пост) Просто скопируйте ссылку из браузера и вставьте в поле поиска вместо поискового запроса.

source: Thanks!
ru: Спасибо, я все понял

source: Just paste the link here
ru: Просто вставьте ссылку сюда

source: Welcome to VK320!
ru: Добро пожаловать в VK320!

# API Error
source: API Error: %@ (vk.com/dev/errors)
ru: Ошибка API: %@ (vk.com/dev/errors)

# API Error Code
source: %@. Code: %li
ru: %@. Код: %li

source: File not found
ru: Файл не найден

source: %.2f Mb
ru: %.2f Мб

source: In queue
ru: В очереди

source: Connecting...
ru: Подключение...

source: %.2f Mb [%.0f%%]
ru: %.2f Мб [%.0f%%]

source: Pause %.2f Mb [%.0f%%]
ru: Пауза %.2f Мб [%.0f%%]

# ALERT_CONNECTION_OFF
source: Check your network connection
ru: Проверьте подключение к интернету

# ALERT_CONNECTION_OFF_UNKNOWN
source: Unknown network connection error
ru: Неизвестная ошибка подключения

# ALERT_CONNECTION_TRY_API
source: Authorization...
ru: Авторизация через VK API...

# ALERT_CONNECTION_TRY
source: Connecting...
ru: Соединение...

# ALERT_LOGOUT
source: Log out...
ru: Сброс авторизации...

# ALERT_CONNECTION_ON
source: Connection established
ru: Соединение установлено

# ALERT_CONNECTION_VK_DENIED
source: Authorization error: No permission to access the audios
ru: Ошибка авторизации: нет разрешения доступа к аудиозаписям

# ALERT_CONNECTION_VK_ERROR
source: Unknown authorization error
ru: Неизвестная ошибка авторизации

# ALERT_CONNECTION_VK_LOGGEDOUT
source: Error: authorization required
ru: Ошибка: необходима авторизация

# ALERT_CONNECTION_SEARCH_ERROR
source: Search request error
ru: Ошибка поискового запроса

# ALERT_CONNECTION_FILESIZE_ERROR
source: File size error
ru: Ошибка получения размера файла

# ALERT_VK_OFF
source: Failed to connect to VK API
ru: Не удалось подключиться к VK API

# ALERT_DOWNLOAD_ERROR
source: Audio download error
ru: Ошибка загрузки аудиозаписи

# ALERT_CHECK_UPDATES_FAIL
source: Failed to check for updates
ru: Не удалось проверить обновления

# ALERT_CHECK_UPDATES_ACTUAL
source: You are using the latest version
ru: Вы используете актуальную версию VK320

# ALERT_ADDTOVK_SUCCESS
source: Song added to VK
ru: Аудиозапись добавлена в ВК

# ALERT_ADDTOVK_FAILURE
source: Failed adding song to VK
ru: Не удалось добавить аудиозапись в ВК

# ALERT_BROADCAST_ON
source: Broadcasting turned on
ru: Трансляция музыки в статус включена

# ALERT_BROADCAST_OFF
source: Broadcasting turned off
ru: Трансляция музыки в статус отключена

# PROCESS_SEARCH_MESSAGE_LINK
source: Getting audios by link....
ru: Запрос аудиозаписей по ссылке...

# PROCESS_SEARCH_MESSAGE_MYMUSIC
source: Getting your profile music...
ru: Запрос аудиозаписей профиля...

# PROCESS_SEARCH_MESSAGE_RECOMMEND
source: Getting recommendations...
ru: Запрос рекомендованных аудиозаписей...

# PROCESS_SEARCH_MESSAGE_OTHER
source: Search request...
ru: Запрос результатов поиска...

# PROCESS_SEARCH_FIN_TEXT
source: Received:
ru: Получено:

# PROCESS_SEARCH_FIN_TEXT_COPYRIGHT
source: deleted due to copyright problems:
ru: изъято по просьбе правообладателя:

# PROCESS_SEARCH_FIN_FILTER
source: filtered:
ru: отфильтровано:

# PROCESS_SEARCH_FIN_FILTER_COPYRIGHT
source: copyright problems:
ru: изъято:

# PROCESS_SEARCH_EMPTY_TEXT
source: Nothing found!
ru: Ничего не найдено!

# ALERT_DOWNLOADS_PATH
source: Unable to find the downloads folder, check the settings.
ru: Не удается найти папку загрузок, проверьте настройки

# UNKNOWN_USERNAME
source: Not authorized
ru: Не авторизирован
